## Pandas

### Instructions

This assignment will be done completely inside this Jupyter notebook with answers placed in the cell provided.

All python imports that are needed shown.

Follow all the instructions in this notebook to complete these tasks.    

Make sure the CSV data files is in the same folder as this notebook - alumni.csv, groceries.csv

In [2]:
# Imports needed to complete this assignment
#importing pandas

import pandas as pd

### Question 1 :  Import CSV file (1 Mark)


Write code to load the alumni csv dataset into a Pandas DataFrame called 'alumni'.

In [6]:
#q1 (1)
#loading the alumni csv dataset into a DataFrame called alumni

alumni = pd.read_csv("./alumni.csv")

### Question 2 :  Understand the data set (5 Marks)

Use the following pandas commands to understand the data set: a) head, b) tail, c) dtypes, d) info, e) describe

In [9]:
#a) (1)
#.head is use to display the top (n) values from the csv by default 5 is return
alumni.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

In [10]:
#b) (1)
#.tail is use to display the top buttom (n) values from the csv by default 5 is return
alumni.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [19]:
#c) (1)
#dtypes provide information for each column datatype
alumni.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)       object
dtype: object

In [20]:
#d) (1)
"""
This .info() method print information about
the alumni csv including the index dtypes 
and columns,non-null values and memory usage.
"""
alumni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
Year Graduated    88 non-null int64
Gender            88 non-null object
Marital Status    88 non-null object
Diploma Type      88 non-null object
Defaulted         88 non-null object
Salary            88 non-null int64
Fee               88 non-null int64
Savings ($)       88 non-null object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

In [21]:
#e) (1)
"""Descriptive statistic include those that
summarize the central tendency,dispersion and shape of a 
dataset distribution excluding NaN values
"""
alumni.describe()

       Year Graduated         Salary           Fee
count       88.000000      88.000000     88.000000
mean      2006.477273   84090.909091  11708.727273
std          1.560852   21234.128008   1110.647949
min       2004.000000   35000.000000  10869.000000
25%       2005.000000   75000.000000  10968.000000
50%       2006.500000   75000.000000  11696.000000
75%       2008.000000   90000.000000  12058.250000
max       2009.000000  160000.000000  20960.000000

In [23]:
#if NaN values want to be included
alumni.describe(include="all")

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
count,88.000000,88,88,88,88,88.000000,88.000000,88
unique,NaN,3,3,2,2,NaN,NaN,31
top,NaN,Male,Married,Standard Diploma,Yes,NaN,NaN,"$32,000"
freq,NaN,46,35,65,52,NaN,NaN,9
mean,2006.477273,NaN,NaN,NaN,NaN,84090.909091,11708.727273,NaN
std,1.560852,NaN,NaN,NaN,NaN,21234.128008,1110.647949,NaN
min,2004.000000,NaN,NaN,NaN,NaN,35000.000000,10869.000000,NaN
25%,2005.000000,NaN,NaN,NaN,NaN,75000.000000,10968.000000,NaN
50%,2006.500000,NaN,NaN,NaN,NaN,75000.000000,11696.000000,NaN
75%,2008.000000,NaN,NaN,NaN,NaN,90000.000000,12058.250000,NaN
max,2009.000000,NaN,NaN,NaN,NaN,160000.000000,20960.000000,NaN

### Question 3 :  Cleaning the data set - part A (3 Marks)

a) Use clean_currency method below to strip out commas and dollar signs from Savings ($) column and put into a new column called 'Savings'.

In [24]:
def clean_currency(curr):
    return float(curr.replace(",", "").replace("$", ""))

clean_currency("$66,000")

66000.0

In [36]:
#a) (2)
#creating a new column call savings from savings ($) and applying clean currency function
alumni['Savings'] = [clean_currency(cost) for cost in alumni['Savings ($)']]

b) Uncomment 'alumni.dtypes.Savings' to check that the type change has occurred

In [37]:
#b) (1)
alumni.dtypes.Savings

dtype('float64')

### Question 4 :  Cleaning the data set - part B (5 Marks)

a) Run the 'alumni["Gender"].value_counts()' to see the incorrect 'M' fields that need to be converted to 'Male'

In [55]:
# a) (1)
# counting the category values
alumni["Gender"].value_counts()

Male      46
Female    39
M          3
Name: Gender, dtype: int64

b) Now use a '.str.replace' on the 'Gender' column to covert the incorrect 'M' fields. Hint: We must use ^...$ to restrict the pattern to match the whole string.

In [63]:
# b) (1)
alumni["Gender"].replace("M" ,"Male",regex=False)

0       Male
1       Male
2     Female
3       Male
4     Female
5     Female
6       Male
7     Female
8       Male
9     Female
10    Female
11    Female
12      Male
13      Male
14    Female
15      Male
16      Male
17    Female
18      Male
19    Female
20      Male
21      Male
22    Female
23      Male
24    Female
25      Male
26    Female
27      Male
28      Male
29      Male
       ...
58    Female
59      Male
60      Male
61    Female
62      Male
63      Male
64    Female
65      Male
66    Female
67    Female
68      Male
69    Female
70    Female
71      Male
72      Male
73    Female
74      Male
75    Female
76      Male
77    Female
78      Male
79    Female
80    Female
81    Female
82      Male
83      Male
84      Male
85      Male
86    Female
87      Male
Name: Gender, Length: 88, dtype: object

In [70]:
# b) (1)
alumni["Gender"].value_counts()

Male      49
Female    39
Name: Gender, dtype: int64

c) That didn't the set alumni["Gender"] column however. You will need to update the column when using the replace command 'alumni["Gender"]=<replace command>', show how this is done below

In [94]:
# c) (1)
alumni["Gender"]=alumni["Gender"].replace("M" ,"Male",regex=False)

d) You can set it directly by using the df.loc command, show how this can be done by using the 'df.loc[row_indexer,col_indexer] = value' command to convert the 'M' to 'Male'

In [93]:
# d) (1)
count = pd.Series([1,2,3])

e) Now run the 'value_counts' for Gender again to see the correct columns - 'Male' and 'Female'

In [95]:
# e) (1)

alumni["Gender"].value_counts()

3.0    1
2.0    1
1.0    1
Name: Gender, dtype: int64

### Question 5 :  Working with the data set (4)

a) get the median, b) mean and c) standard deviation for the 'Salary' column

In [17]:
# a)(1)

In [18]:
# b)(1)

In [19]:
# c)(1)

d) identify which alumni paid more than $15000 in fees, using the 'Fee' column

In [20]:
# d) (1)

### Question 6 :  Visualise the data set (4 Marks)

a) Using the 'Diploma Type' column, plot a bar chart and show its value counts.

In [21]:
#a) (1)

b) Now create a box plot comparison between 'Savings' and 'Salary' columns

In [22]:
#b) (1)

c) Generate a histogram with the 'Salary' column and use 12 bins.

In [23]:
#c) (1)

d) Generate a scatter plot comparing 'Salary' and 'Savings' columns.

In [24]:
#d) (1)

### Question 7 :  Contingency Table (2 Marks)

Using both the 'Martial Status' and 'Defaulted' create a contingency table. Hint: crosstab

In [25]:
# Q7 (2)